[{"name":"Baklava","slug":"baklava","link":"","description":"<p>A rich, sweet dessert pastry made of layers of filo filled with chopped nuts and sweetened with syrup or honey.</p>\n","longDescription":"<p>Baklava is one of Turkey&#39;s most recognizable dessert dishes. This delectable pastry treat is made of layer after layer of thin <em>yufka</em> dough.</p>\n","image":{"url":"/assets/images/baklava.jpeg"},"ingredients":"<ul>\n<li>1 lb filo dough</li>\n<li>1 1/2 cup unsalted butter, melted</li>\n<li>1 lb finely chopped nuts (walnuts, pistachios, or a mixture of both)</li>\n<li>1 tsp ground cinnamon</li>\n<li>1/4 tsp ground cloves</li>\n<li>1/4 tsp ground cardamom</li>\n<li>1/4 tsp salt</li>\n<li>1 1/2 cup granulated sugar</li>\n<li>1 1/2 cup water</li>\n<li>1 tbsp fresh lemon juice</li>\n<li>1/2 cup honey</li>\n</ul>\n","instructions":"<ol>\n<li>Preheat oven to 350°F.</li>\n<li>Layer the filo dough and chopped nuts in a baking dish, brushing melted butter between each layer.</li>\n<li>Bake for 30-35 minutes, or until golden brown.</li>\n<li>In a saucepan, combine sugar, cinnamon, and lemon juice to make the syrup. Bring to a boil and let simmer for 10-15 minutes.</li>\n<li>Pour the syrup over the baked baklava, and let it cool completely before serving.</li>\n</ol>\n","additionalNotes":"<p>Baklava can be made with a variety of different nuts, such as pistachios, walnuts, or almonds. It&#39;s best served with a cup of strong Turkish coffee.</p>\n","prepTime":"45m","cookTime":"55m"},{"name":"Kebab","slug":"kebab","link":"","description":"<p>A popular Turkish dish of grilled or roasted meat, often served on skewers or wrapped in flatbread.</p>\n","longDescription":"<p>Kebab is a popular Turkish dish that is often served as street food. It typically consists of grilled or roasted meat (such as beef, lamb, chicken, or fish) that is served on skewers or wrapped in flatbread.</p>\n","image":{"url":"/assets/images/kebab.jpeg"},"ingredients":"<ul>\n<li>1 pound meat (beef, lamb, chicken, or fish)</li>\n<li>1 onion, chopped</li>\n<li>2 garlic cloves, minced</li>\n<li>2 tablespoons olive oil</li>\n<li>2 tablespoons lemon juice</li>\n<li>1/2 teaspoon salt</li>\n<li>1/4 teaspoon black pepper</li>\n<li>1 cup plain yogurt</li>\n<li>1 cucumber, peeled and diced</li>\n<li>1 tomato, diced</li>\n<li>4 flatbreads</li>\n</ul>\n","instructions":"<ol>\n<li>Cut the meat into 1-inch cubes and place in a large bowl.</li>\n<li>In a separate bowl, mix together the chopped onion, minced garlic, olive oil, lemon juice, salt, and black pepper.</li>\n<li>Pour the marinade over the meat and toss to coat evenly. Cover the bowl with plastic wrap and refrigerate for at least 1 hour, or up to overnight.</li>\n<li>If using wooden skewers, soak them in water for 30 minutes to prevent them from burning.</li>\n<li>Preheat the grill or broiler to medium-high heat.</li>\n<li>Thread the marinated meat onto the skewers, leaving a little space between each piece of meat.</li>\n<li>Grill or broil the kebabs for 6-8 minutes on each side, or until the meat is cooked to your desired level of doneness.</li>\n<li>While the kebabs are cooking, mix together the yogurt, diced cucumber, and diced tomato in a small bowl.</li>\n<li>Serve the kebabs hot with the yogurt sauce and flatbreads.</li>\n</ol>\n","additionalNotes":"<p>Kebab can be seasoned with a variety of spices and herbs, such as paprika, cumin, or oregano. Some variations may also include vegetables, such as bell peppers or zucchini.</p>\n","prepTime":"2h 30m","cookTime":"15m"},{"name":"Menemen","slug":"menemen","link":"","description":"<p>A traditional Turkish breakfast dish made with eggs, tomatoes, green peppers, and spices.</p>\n","longDescription":"<p>Menemen is a traditional Turkish breakfast dish that is made with eggs, tomatoes, green peppers, and spices. It is typically served with bread and tea.</p>\n","image":{"url":"/assets/images/menemen.jpeg"},"ingredients":"<ul>\n<li>2 tablespoons olive oil</li>\n<li>1 onion, chopped</li>\n<li>1 green pepper, chopped</li>\n<li>2 garlic cloves, minced</li>\n<li>2 tomatoes, chopped</li>\n<li>4 eggs</li>\n<li>1/2 teaspoon salt</li>\n<li>1/4 teaspoon black pepper</li>\n<li>1/4 teaspoon Turkish red pepper flakes (<em>pul biber</em>)</li>\n<li>4 slices bread</li>\n<li>Tea, to serve</li>\n</ul>\n","instructions":"<ol>\n<li>Heat olive oil in a pan over medium heat.</li>\n<li>Add onion and green pepper and sauté until softened.</li>\n<li>Add garlic and tomatoes and cook until the tomatoes are soft and slightly broken down.</li>\n<li>Crack the eggs into the pan and stir gently until the eggs are cooked to your desired doneness.</li>\n<li>Season with salt, pepper, and Turkish red pepper flakes to taste.</li>\n<li>Serve the menemen with bread and tea.</li>\n</ol>\n","additionalNotes":"<p>Menemen is a versatile dish that can be customized to your taste. You can add additional vegetables, such as mushrooms or spinach, or herbs, such as parsley or cilantro, to the dish.</p>\n","prepTime":"10m","cookTime":"15m"},{"name":"Lahmacun","slug":"lahmacun","link":"","description":"<p>A popular Turkish street food made with a thin, crispy crust and topped with spicy minced meat, vegetables, and herbs.</p>\n","longDescription":"<p>Lahmacun is a popular Turkish street food that is enjoyed all over the country. It is made with a thin, crispy crust that is topped with a spicy mixture of minced meat, vegetables, and herbs. It is often served with lemon wedges and parsley.</p>\n","image":{"url":"/assets/images/lahmacun.jpeg"},"ingredients":"<ul>\n<li>1 lb ground lamb or beef</li>\n<li>1/2 cup chopped onion</li>\n<li>3 cloves garlic, minced</li>\n<li>1/4 cup tomato paste</li>\n<li>1/4 cup chopped parsley</li>\n<li>2 tablespoons lemon juice</li>\n<li>1 tablespoon paprika</li>\n<li>1 teaspoon cumin</li>\n<li>1/2 teaspoon salt</li>\n<li>1/2 teaspoon black pepper</li>\n<li>1 recipe pizza dough</li>\n<li>2 tablespoons olive oil</li>\n<li>1 tablespoon cornmeal</li>\n</ul>\n","instructions":"<ol>\n<li>In a large bowl, combine the ground lamb or beef, onion, garlic, tomato paste, parsley, lemon juice, paprika, cumin, salt, and black pepper. Mix well to combine.</li>\n<li>Divide the pizza dough into 8 equal pieces. Roll each piece into a thin circle on a floured surface. Place the circles on baking sheets that have been dusted with cornmeal.</li>\n<li>Spread the meat mixture evenly over the dough circles, leaving a small border around the edges.</li>\n<li>Bake in a preheated 450 degree F oven for 8-10 minutes, or until the crust is golden brown and the meat is cooked through.</li>\n<li>Serve hot with lemon wedges and parsley.</li>\n</ol>\n","additionalNotes":"<p>Lahmacun can be served as a main course or as a snack. It is often topped with lettuce, tomatoes, and onions and rolled up like a burrito.</p>\n","prepTime":"30m","cookTime":"10m"},{"name":"Köfte","slug":"kofte","link":"","description":"<p>A traditional Turkish meatball made with ground beef or lamb, onions, and spices.</p>\n","longDescription":"<p>Köfte is a popular dish in Turkish cuisine, and is essentially a meatball made from ground beef or lamb mixed with onions and spices. The meat mixture is formed into small balls or oblong shapes, and then cooked until browned and fully cooked through. The spices used in köfte can vary, but common ones include cumin and coriander. The meatballs are often served with rice or pide (Turkish bread), and a side salad. Köfte is a flavorful and satisfying dish that is enjoyed all over Turkey.</p>\n","image":{"url":"/assets/images/kofte.jpeg"},"ingredients":"<ul>\n<li>1 lb ground beef or lamb</li>\n<li>1/2 cup finely chopped onion</li>\n<li>2 cloves garlic, minced</li>\n<li>1/4 cup chopped parsley</li>\n<li>1 egg, beaten</li>\n<li>1 teaspoon ground cumin</li>\n<li>1 teaspoon ground coriander</li>\n<li>1/2 teaspoon salt</li>\n<li>1/4 teaspoon black pepper</li>\n<li>1/4 cup breadcrumbs</li>\n<li>2 tablespoons olive oil</li>\n</ul>\n","instructions":"<ol>\n<li>In a large bowl, combine the ground beef or lamb, onion, garlic, parsley, egg, cumin, coriander, salt, black pepper, and breadcrumbs. Mix well to combine.</li>\n<li>Shape the mixture into small balls or oblong shapes.</li>\n<li>Heat the olive oil in a large skillet over medium-high heat. Add the köfte and cook until browned on all sides and cooked through, about 8-10 minutes.</li>\n<li>Serve hot with rice or pide (Turkish bread) and a side salad.</li>\n</ol>\n","additionalNotes":"<p>Köfte can be made with different types of ground meat and spices. It is a staple of Turkish cuisine and is enjoyed all over the country.</p>\n","prepTime":"25m","cookTime":"20m"}]